package com.neuedu.Javabiji;


//先创建类，再创建对象，用对象调用类，类是一个总体，描述它，
//然后用对象调用，调用时，名后面一个点，出来括号，说明调用的为方法，
//如果不出来括号，说明调用的为类


//访问权限标识符，class表示类，为关键词，  Student为类名
public class Student {
    //只写类的东西，定义一个类
    //创建一个类，抽象概念
    //创建好类，他是个抽象概念    表示类中具体某一个学生，，，，用对象表示
    //从抽象到具体的过程
    String sname; //字符串类型
     int  sage;


    //若相对其中某一个做验证，呢就在方法内，列如main就是方法，后面括号内写

    //   格式：访问权限修饰符，有无返回值，
    //方法名（参数列表）{方法符}
    //   public void a(){//void无返回值，只需要调用,,括号内没东西：无参数，
    //      System.out.println(1);    //以上为定义一个方法
    //方法执行过程：1：执行 2;调用

    //无参，有返回值：
    //    public long add(){
    //       int a=1;
    //       int b=2;
    //       int c=a+b;
    //       return c;//return出来的什么类型，上面就写什么类型
    //   有返回值：做完东西必须要有结果,返回的时候是什么最后就写什么


    //       }
//    }
    //方法调用时，传递的值，实际的参数
       //在方法定义时，参数   形式参数，也叫形参

   // public void add(a){

 //把具有某种功能的代码，放到方法里面，通过对象去调用，这个过程就是封装
//如果想调用它很多次，可以给他一个循环，设置调用多少次；

    //在某个方法里定义一个变量叫局部变量
    //定义一个方法，打印输出学生信息

//类可看做有花纹特征的模子，
   // public void print


    }





